rhoPimple/hagen-poiseuille_axis/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       3100;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          20;
        startFace       3120;
    }
    front
    {
        type            wedge;
        physicalType    wedge;
        nFaces          1600;
        startFace       3140;
    }
    wall
    {
        type            patch;
        physicalType    patch;
        nFaces          80;
        startFace       4740;
    }
    back
    {
        type            wedge;
        physicalType    wedge;
        nFaces          1600;
        startFace       4820;
    }
)

// ************************************************************************* //
